{
  "altLang": "en",
  "welcome": {
    "badgeInfo": "Desarrollador Web",
    "contact": "contacto"
  },
  "about": {
    "sectionTitle": "Sobre Mí",
    "content": "Ingeniero de Sistemas y Computación y Desarrollador Web con experiencia en metodologías ágiles. Competente en tecnologías como JavaScript, Python, React, Node.js y bases de datos relacionales y no relacionales. Historial comprobado en la resolución eficiente de problemas, con capacidad demostrada para adaptarse rápidamente a nuevas tecnologías y entornos de desarrollo."
  },
  "experience": {
    "sectionTitle": "Experiencia",
    "item": [
      {
        "role": "Desarrollador Junior",
        "company": "Universidad De Cundinamarca",
        "duration": "2+ Años",
        "imgName": "coffee.png",
        "items": [
          "Colaboré con un equipo de ingenieros de sistemas en el desarrollo del front-end de un libro de recetas para permitir a los estudiantes crear, editar y compartir recetas.",
          "Desarrollé el front-end de una plataforma para freelancers enfocada en el reclutamiento y creación de servicios médicos utilizando la metodología SCRUM.",
          "Experiencia con React.js en la construcción de varias SPAs (Aplicaciones de Página Única) interactivas."
        ]
      },
      {
        "role": "Tutor de Algoritmos y Programador Competitivo",
        "company": "Universidad De Cundinamarca",
        "duration": "Abril 2022 - Actualidad",
        "imgName": "comp.png",
        "items": [
          "Impartir tutorías de programación competitiva en C++ y Python, guiando a los estudiantes para mejorar sus habilidades en algoritmos y estructuras de datos.",
          "Mantenerse actualizado mediante investigación exhaustiva y revisión constante de documentación técnica relacionada con algoritmos y estructuras de datos.",
          "Participante activo en competencias nacionales e internacionales, como ICPC, CCPL, Codeforces Divs y RPC."
        ]
      }
    ]
  },
  "skills": {
    "sectionTitle": [
      "Habilidades",
      "Idiomas"
    ]
  },
  "languages": [
    {
      "language": "Español",
      "level": "Nativo",
      "certificate":""
    },
    {
      "language": "Inglés",
      "level": "C1",
      "certificate":"https://cert.efset.org/2yp1Ke"
    }
  ],
  "projects": {
    "sectionTitle": "Proyectos",
    "item": [
            {
        "projectTitle": "Aurora",
        "projectDescription": "Este sistema ha sido desarrollado como parte de un proyecto de investigación en la Universidad de Cundinamarca Extensión Facatativá, con el objetivo de brindar a los estudiantes del programa de Psicología una herramienta de apoyo para el diagnóstico de trastornos depresivos. Utilizando técnicas avanzadas de machine learning, el sistema analiza datos clínicos para identificar patrones y factores de riesgo asociados con trastornos depresivos, proporcionando una herramienta complementaria al juicio clínico profesional.",
        "projectYear": "2025",
        "projectLinks": {
          "code": "https://github.com/TatoNaranjo/Aurora-Front-End",
          "demo": "https://github.com/TatoNaranjo/Aurora-Front-End",
          "design": "https://www.figma.com/design/jnKeC3tEU6BbSCyhXHAmtJ/Clasificaci%C3%B3n-de-Trastornos?node-id=19-36&t=ROUEE81pPpLn6lxA-1"
        },
        "techStack": [
          "React",
          "Node.JS",
          "Python",
          "TypeScript",
          "Django",
          "Figma",
          "Visual Paradigm"
        ]
      },
      {
        "projectTitle": "Mitigación Emocional",
        "projectDescription": "Este proyecto es una aplicación web full-stack diseñada para la detección y mitigación emocional a través de la música; el núcleo del sistema es un modelo de Deep Learning (Red Neuronal Densa con TensorFlow/Keras) que analiza las características de audio de una canción para clasificarla en tres emociones: Ira, Tristeza o Felicidad. El backend, construido en Python con Flask, sirve este modelo y se conecta a la API de Spotify (Spotipy) para recomendar playlists de mitigación que ayuden al usuario a regular su estado de ánimo. El proyecto va más allá de la demo principal, ofreciendo un dashboard de métricas (construido con Chart.js) para evaluar el rendimiento del modelo y una línea de tiempo de trazabilidad interactiva. Esta última documenta el proceso completo de investigación y las decisiones de ingeniería, incluyendo el pivoteo desde un modelo CNN fallido a la solución DNN actual, demostrando un ciclo de vida de desarrollo de ML completo.",
        "projectYear": "2025",
        "projectLinks": {
          "code": "https://github.com/TatoNaranjo/MitigacionEmocionalDL",
          "demo": "https://github.com/TatoNaranjo/MitigacionEmocionalDL",
          "design": "https://github.com/TatoNaranjo/MitigacionEmocionalDL"
        },
        "techStack": [
          "React",
          "Node.JS",
          "Python",
          "Keras",
          "Tensorflow",
          "TypeScript",
          "Django"
        ]
      },
      {
        "projectTitle": "Reconocimiento de Mariposas con Retropropagación",
        "projectDescription": "Desarrollé una aplicación de escritorio completa con MATLAB App Designer para la clasificación de mariposas; La herramienta principal permite al usuario cargar una imagen y, mediante un modelo de red neuronal entrenado, el sistema identifica y predice la especie de la mariposa. El proyecto demuestra un flujo de trabajo de machine learning de principio a fin. Además de la app de clasificación, creé módulos independientes para el entrenamiento del modelo y para el procesamiento de imágenes. Esta última utilidad permite cargar y aplicar dinámicamente diferentes kernels (definidos en un JSON) para visualizar cómo los filtros afectan a la extracción de características.",
        "projectYear": "2025",
        "projectLinks": {
          "code": "https://github.com/TatoNaranjo/BPMariposas",
          "demo": "https://github.com/TatoNaranjo/BPMariposas",
          "design": "https://github.com/TatoNaranjo/BPMariposas"
        },
        "techStack": [
          "MatLab"
        ]
      },
      {
        "projectTitle": "Tato's Roguelike",
        "projectDescription": "\"El Roguelike de Tato\" es un proyecto de desarrollo de juegos que documenta mi aprendizaje práctico de Python aplicado a un género que me apasiona; El resultado es un juego funcional de exploración de mazmorras donde el jugador navega por niveles generados aleatoriamente. Construido desde cero siguiendo el popular tutorial de Roguelike, el proyecto utiliza tcod para la interfaz de consola y Numpy para operaciones de datos. El código está estructurado de manera modular y está completamente abierto a contribuciones, reflejando mi interés por el software de código abierto y el aprendizaje colaborativo.",
        "projectYear": "2024",
        "projectLinks": {
          "code": "https://github.com/TatoNaranjo/ElRoguelikeDeTato",
          "demo": "https://github.com/TatoNaranjo/ElRoguelikeDeTato",
          "design": "https://github.com/TatoNaranjo/ElRoguelikeDeTato"
        },
        "techStack": [
          "Python"
        ]
      }
    ]
  },
  "education": {
    "sectionTitle": "Educación",
    "item": [
      {
        "eduTitle": "Colegio E.I San Miguel Arcángel",
        "degree": "Bachillerato",
        "startDate": "2010",
        "endDate": "2021",
        "items": [
          "Diseño Web HTML",
          "Desarrollo C++ con Arduino"
        ]
      },
      {
        "eduTitle": "Universidad De Cundinamarca",
        "degree": "Pregrado - Ingeniería de Sistemas",
        "startDate": "2021",
        "endDate": "2026",
        "items": [
          "Programación y Desarrollo de Software",
          "Arquitecturas de Sistemas y Bases de Datos Relacionales / No Relacionales"
        ]
      },
      {
        "eduTitle": "Oracle Next Education",
        "degree": "Prácticas de Desarrollo",
        "startDate": "2023",
        "endDate": "2024",
        "items": [
          "Proyectos prácticos que simulan escenarios del mundo real",
          "Diseño Responsivo y Accesibilidad Web"
        ]
      }
    ]
  },
  "footer": {
    "subtitle": "Desarrollador Web"
  }
}